app/controllers/appointments_controller.rb

    scope = current_user.organization.appointments.includes(:client, :service).order(scheduled_at: :asc)
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" IN (10, 9, 8, 11, 12, 13, 14)
SELECT "services".* FROM "services" WHERE "services"."id" IN (9, 8, 7, 10, 11, 12)

      scope = scope.joins(:client, :service)
                   .where("clients.name ILIKE :term OR services.name ILIKE :term", term: term)
    end

    if params[:from].present? && params[:to].present?
---
SELECT "clients"."id", "clients"."name" FROM "clients" ORDER BY "clients"."name" ASC

      scope = scope.where(scheduled_at: from_date.beginning_of_day..to_date.end_of_day)
    end

    pagy, appointments = pagy(scope, limit: 12)

    render inertia: "Appointments/Index", props: {
      appointments: appointments.map do |appt|
        {
          id: appt.id,
          client_id: appt.client_id,
          service_id: appt.service_id,
          scheduled_at: appt.scheduled_at.iso8601,
          client_name: appt.client.name,
          date: appt.scheduled_at.strftime("%d %b %Y"),
          time: appt.scheduled_at.strftime("%H:%M"),
          service_name: appt.service.name,
          status: appt.status
        }
      end,
      stats: {
        total_week: current_user.organization.appointments.where(scheduled_at: Date.current.beginning_of_week..Date.current.end_of_week).count,
        confirmed: current_user.organization.appointments.where(status: "confirmed").count,
        cancelled: current_user.organization.appointments.where(status: "cancelled").count,
        completed: current_user.organization.appointments.where(status: "completed").count
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."status" = 'confirmed' ORDER BY "appointments"."scheduled_at" ASC LIMIT 12 OFFSET 0

        page: pagy.page,
        pages: pagy.pages,
        count: pagy.count
      },
      clients: current_user.organization.clients.order(:name).select(:id, :name).map { |c| { id: c.id, name: c.name } },
      services: current_user.organization.services.order(:name).select(:id, :name, :duration_minutes, :price).map { |s| { id: s.id, name: s.name, duration_minutes: s.duration_minutes, price: s.price.to_f } }
---
SELECT "clients"."id", "clients"."name" FROM "clients" ORDER BY "clients"."name" ASC
SELECT "services"."id", "services"."name", "services"."duration_minutes", "services"."price" FROM "services" ORDER BY "services"."name" ASC

  def create
    appointment = current_user.organization.appointments.new(appointment_params)
    if appointment.save
---
INSERT INTO "appointments" ("client_id", "service_id", "scheduled_at", "status", "notes", "created_at", "updated_at") VALUES (29, 22, '2027-06-09 08:22:00', 'confirmed', NULL, '2026-07-20 08:22:09.830473', '2026-07-20 08:22:09.830473') RETURNING "id"

  def update
    appointment = current_user.organization.appointments.find(params[:id])
    if appointment.update(appointment_params)
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = 41 LIMIT 1
UPDATE "appointments" SET "scheduled_at" = '2026-07-18 08:54:00', "updated_at" = '2026-07-20 08:54:45.141287' WHERE "appointments"."id" = 48

  def destroy
    appointment = current_user.organization.appointments.find(params[:id])
    appointment.destroy
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = 41 LIMIT 1
DELETE FROM "appointments" WHERE "appointments"."id" = 41