app/controllers/clients_controller.rb

  def client_json(client)
    completed = client.appointments.completed

    {
      id: client.id,
      name: client.name,
      phone: client.phone,
      vip: client.vip || false,
      last_visit: client.appointments.maximum(:scheduled_at)&.strftime("%d %b %Y") || "Sin visitas",
      visit_count: completed.count,
      total_spent: completed.joins(:service).sum("services.price"),
      favorite_service: favorite_service_for(client),
      appointment_history: client.appointments.includes(:service).order(scheduled_at: :desc).limit(5).map do |appt|
---
SELECT "services".* FROM "services" WHERE "services"."id" IN (15, 14)

  def favorite_service_for(client)
    result = client.appointments.joins(:service)
                    .group("services.name")
                    .order(Arel.sql("COUNT(appointments.id) DESC"))
                    .limit(1)
                    .count
---
SELECT COUNT(*) AS "count_all", "services"."name" AS "services_name" FROM "appointments" INNER JOIN "services" ON "services"."id" = "appointments"."service_id" WHERE "appointments"."client_id" = 21 GROUP BY "services"."name" ORDER BY COUNT(appointments.id) DESC LIMIT 1