app/controllers/clients_controller.rb

    scope = Client.order(:name)
---
SELECT "clients".* FROM "clients" ORDER BY "clients"."name" ASC

      scope = scope.where("name ILIKE :term OR phone ILIKE :term", term: term)
    end

    clients = scope.map { |client| client_json(client) }

    render inertia: "Clients/Index", props: {
      clients: clients,
      stats: {
        total: Client.count,
        vip_count: Client.where(vip: true).count
      },
      filters: {
        search: params[:search] || ""
      },
      services: Service.order(:name).select(:id, :name, :duration_minutes, :price).map { |s| { id: s.id, name: s.name, duration_minutes: s.duration_minutes, price: s.price.to_f } }
---
SELECT COUNT(*) FROM "clients" WHERE "clients"."vip" = TRUE
SELECT "services"."id", "services"."name", "services"."duration_minutes", "services"."price" FROM "services" ORDER BY "services"."name" ASC

  def create
    client = Client.new(client_params)
    if client.save
---
INSERT INTO "clients" ("name", "phone", "email", "notes", "vip", "created_at", "updated_at", "instagram_handle") VALUES ('nuevo', '8888888', NULL, NULL, TRUE, '2026-07-20 11:07:39.734475', '2026-07-20 11:07:39.734475', '') RETURNING "id"

  def update
    client = Client.find(params[:id])
    if client.update(client_params)
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = 28 LIMIT 1
UPDATE "clients" SET "name" = 'Andrea Sota', "updated_at" = '2026-07-18 09:02:10.246350' WHERE "clients"."id" = 28

  def destroy
    client = Client.find(params[:id])

    if client.appointments.where("scheduled_at >= ?", 7.days.ago).exists?
      redirect_to clients_path, alert: "No se puede eliminar a #{client.name} porque tiene citas próximas o de la última semana. Esperá a que pase ese período, o cancelá/reasigná la cita primero."
    else
      client.destroy
---
SELECT "clients".* FROM "clients" WHERE "clients"."id" = 30 LIMIT 1
SELECT 1 AS one FROM "appointments" WHERE "appointments"."client_id" = 30 LIMIT 1
DELETE FROM "clients" WHERE "clients"."id" = 30

  def client_json(client)
    completed = client.appointments.completed

    {
      id: client.id,
      name: client.name,
      phone: client.phone,
      instagram_handle: client.instagram_handle,
      vip: client.vip || false,
      last_visit: client.appointments.maximum(:scheduled_at)&.strftime("%d %b %Y") || "Sin visitas",
      visit_count: completed.count,
      total_spent: completed.joins(:service).sum("services.price"),
      favorite_service: favorite_service_for(client),
      appointment_history: client.appointments.includes(:service).order(scheduled_at: :desc).limit(5).map do |appt|
---
SELECT "services".* FROM "services" WHERE "services"."id" IN (21, 24)

  def favorite_service_for(client)
    result = client.appointments.joins(:service)
                    .group("services.name")
                    .order(Arel.sql("COUNT(appointments.id) DESC"))
                    .limit(1)
                    .count
---
SELECT COUNT(*) AS "count_all", "services"."name" AS "services_name" FROM "appointments" INNER JOIN "services" ON "services"."id" = "appointments"."service_id" WHERE "appointments"."client_id" = 29 GROUP BY "services"."name" ORDER BY COUNT(appointments.id) DESC LIMIT 1