app/controllers/dashboard_controller.rb

  def today_appointments
    Appointment.today.includes(:client, :service).order(:scheduled_at).map do |appt|
---
SELECT MAX("appointments"."scheduled_at") FROM "appointments" WHERE "appointments"."client_id" = 21
SELECT "appointments".* FROM "appointments" WHERE "appointments"."scheduled_at" BETWEEN '2026-07-09 00:00:00' AND '2026-07-09 23:59:59.999999' ORDER BY "appointments"."scheduled_at" ASC
SELECT "clients".* FROM "clients" WHERE "clients"."id" IN (15, 16, 17, 18, 19, 20, 21)
SELECT "services".* FROM "services" WHERE "services"."id" IN (14, 15, 16, 17, 18, 13)

  def recent_clients
    Client.order(created_at: :desc).limit(5).map do |client|
---
SELECT "clients".* FROM "clients" ORDER BY "clients"."created_at" DESC LIMIT 5

  def popular_services
    Service.left_joins(:appointments)
      .group("services.id")
      .order(Arel.sql("COUNT(appointments.id) DESC"))
      .limit(5)
      .map do |service|
        {
          id: service.id,
          name: service.name,
          appointment_count: service.appointments.count
---
SELECT "services".* FROM "services" LEFT OUTER JOIN "appointments" ON "appointments"."service_id" = "services"."id" GROUP BY "services"."id" ORDER BY COUNT(appointments.id) DESC LIMIT 5
SELECT COUNT(*) FROM "appointments" WHERE "appointments"."service_id" = 15