app/controllers/dashboard_controller.rb

SELECT MAX("appointments"."scheduled_at") FROM "appointments" WHERE "appointments"."client_id" = 21
---
  def today_appointments
    Appointment.today.includes(:client, :service).order(:scheduled_at).map do |appt|