app/controllers/notifications_controller.rb

SELECT "appointments".* FROM "appointments" WHERE "appointments"."status" = 'confirmed' AND "appointments"."scheduled_at" BETWEEN '2026-07-20 00:00:00' AND '2026-07-20 23:59:59.999999' ORDER BY "appointments"."scheduled_at" ASC LIMIT 10
SELECT "clients".* FROM "clients" WHERE "clients"."id" IN (24, 26, 28)
SELECT "services".* FROM "services" WHERE "services"."id" IN (22, 24, 21)
SELECT "appointments".* FROM "appointments" WHERE "appointments"."status" = 'pending' ORDER BY "appointments"."scheduled_at" ASC LIMIT 10
SELECT COUNT(*) FROM "appointments" WHERE "appointments"."status" = 'pending'
---
  def pending
    appointments = Appointment.includes(:client, :service)
                              .where(status: "pending")
                              .order(scheduled_at: :asc)
                              .limit(10)

    render json: {
      count: Appointment.where(status: "pending").count,
      appointments: appointments.map do |appt|