app/controllers/services_controller.rb

  def create
    service = Service.new(service_params)
    if service.save
---
INSERT INTO "services" ("name", "duration_minutes", "price", "description", "active", "created_at", "updated_at") VALUES ('dlfl', 1, 1000.0, 'adwd', TRUE, '2026-07-18 08:56:52.479748', '2026-07-18 08:56:52.479748') RETURNING "id"

  def update
    service = Service.find(params[:id])
    if service.update(service_params)
---
SELECT "services".* FROM "services" WHERE "services"."id" = 24 LIMIT 1
UPDATE "services" SET "duration_minutes" = 91, "description" = '', "updated_at" = '2026-07-18 08:55:39.248745' WHERE "services"."id" = 24

  def destroy
    service = Service.find(params[:id])
    service.destroy
---
SELECT "services".* FROM "services" WHERE "services"."id" = 25 LIMIT 1
DELETE FROM "services" WHERE "services"."id" = 25

  def services
    Service.left_joins(:appointments)
      .select("services.*, COUNT(appointments.id) AS appointment_count")
      .group("services.id")
      .order(:name)
      .map do |service|
---
SELECT COUNT(*) AS "count_all", "services"."name" AS "services_name" FROM "services" INNER JOIN "appointments" ON "appointments"."service_id" = "services"."id" GROUP BY "services"."name" ORDER BY COUNT(appointments.id) DESC LIMIT 1
SELECT services.*, COUNT(appointments.id) AS appointment_count FROM "services" LEFT OUTER JOIN "appointments" ON "appointments"."service_id" = "services"."id" GROUP BY "services"."id" ORDER BY "services"."name" ASC

  def stats
    {
      total: Service.count,
      most_popular: most_popular_service_name,
      average_price: Service.average(:price).to_f.round,
      active_count: Service.where(active: true).count
---
SELECT COUNT(*) FROM "services" WHERE "services"."active" = TRUE

  def most_popular_service_name
    result = Service.joins(:appointments)
                     .group(:name)
                     .order(Arel.sql("COUNT(appointments.id) DESC"))
                     .limit(1)
                     .count
---
SELECT COUNT(*) AS "count_all", "services"."name" AS "services_name" FROM "services" INNER JOIN "appointments" ON "appointments"."service_id" = "services"."id" GROUP BY "services"."name" ORDER BY COUNT(appointments.id) DESC LIMIT 1