app/controllers/services_controller.rb

SELECT services.*, COUNT(appointments.id) AS appointment_count FROM "services" LEFT OUTER JOIN "appointments" ON "appointments"."service_id" = "services"."id" GROUP BY "services"."id" ORDER BY "services"."name" ASC
---
  def services
    Service.left_joins(:appointments)
      .select("services.*, COUNT(appointments.id) AS appointment_count")
      .group("services.id")
      .order(:name)
      .map do |service|

SELECT COUNT(*) FROM "services" WHERE "services"."active" = TRUE
---
  def stats
    {
      total: Service.count,
      most_popular: most_popular_service_name,
      average_price: Service.average(:price).to_f.round,
      active_count: Service.where(active: true).count