app/controllers/settings_controller.rb

  def update_business
    if current_user.update(business_params)
---
UPDATE "users" SET "updated_at" = '2026-07-20 11:19:13.931045', "business_name" = 'Nail Studio', "business_phone" = '', "business_address" = '' WHERE "users"."id" = 4

  def update_password
    if current_user.valid_password?(params[:current_password])
      if params[:new_password] != params[:new_password_confirmation]
        redirect_to settings_path, alert: "Las contraseñas nuevas no coinciden"
      elsif current_user.update(password: params[:new_password], password_confirmation: params[:new_password_confirmation])
---
UPDATE "users" SET "updated_at" = '2026-07-20 11:20:04.438472', "encrypted_password" = '$2a$12$ikc9SJPAJqXom12Ct8pox.IPPQZ3mnSlSkWkEgJwjKVJkFEEzX8sm' WHERE "users"."id" = 4