app/controllers/statistics_controller.rb

SELECT COUNT(*) FROM "appointments" WHERE "appointments"."scheduled_at" BETWEEN '2026-07-01' AND '2026-07-31'
---
  def index
    completed = Appointment.where(status: "completed").includes(:service)

    render inertia: "Statistics/Index", props: {
      stats: {
        revenue_month: revenue_for_month(Date.current),
        appointments_month: Appointment.where(scheduled_at: Date.current.beginning_of_month..Date.current.end_of_month).count,
        average_ticket: average_ticket,
        total_clients: Client.count

SELECT SUM("services"."price") FROM "appointments" INNER JOIN "services" ON "services"."id" = "appointments"."service_id" WHERE "appointments"."status" = 'completed' AND "appointments"."scheduled_at" BETWEEN '2026-07-01' AND '2026-07-31'
---
  def revenue_for_month(date)
    Appointment.where(status: "completed", scheduled_at: date.beginning_of_month..date.end_of_month)
               .joins(:service).sum("services.price").to_f

SELECT COUNT(*) AS "count_all", "appointments"."status" AS "appointments_status" FROM "appointments" GROUP BY "appointments"."status"
---
  def status_distribution
    Appointment.group(:status).count.map { |status, count| { status: status, count: count } }

SELECT SUM("services"."price") FROM "appointments" INNER JOIN "services" ON "services"."id" = "appointments"."service_id" WHERE "appointments"."status" = 'completed'
SELECT COUNT(*) FROM "appointments" INNER JOIN "services" ON "services"."id" = "appointments"."service_id" WHERE "appointments"."status" = 'completed'
---
  def average_ticket
    completed = Appointment.where(status: "completed").joins(:service)
    total = completed.sum("services.price").to_f
    count = completed.count

SELECT SUM("services"."price") AS "sum_services_price", "services"."id" AS "services_id", "services"."name" AS "services_name" FROM "appointments" INNER JOIN "services" ON "services"."id" = "appointments"."service_id" WHERE "appointments"."status" = 'completed' GROUP BY "services"."id", "services"."name"
---
  def top_services
    Appointment.where(status: "completed")
               .joins(:service)
               .group("services.id", "services.name")
               .sum("services.price")
               .sort_by { |_key, revenue| -revenue }
               .first(5)
               .map { |(_id, name), revenue| { name: name, revenue: revenue.to_f } }