app/models/appointment.rb

  def no_overlapping_appointments
    return unless scheduled_at.present? && service.present?
    return unless new_record? || scheduled_at_changed?

    new_start = scheduled_at
    new_end = scheduled_at + service.duration_minutes.minutes

    overlapping = Appointment
                    .where.not(id: id)
                    .joins(:service)
                    .where.not(status: "cancelled")
                    .where(
                      "appointments.scheduled_at < ? AND (appointments.scheduled_at + (services.duration_minutes * interval '1 minute')) > ?",
                      new_end, new_start
                    )

    if overlapping.exists?
---
SELECT 1 AS one FROM "appointments" INNER JOIN "services" ON "services"."id" = "appointments"."service_id" WHERE "appointments"."id" IS NOT NULL AND "appointments"."status" != 'cancelled' AND (appointments.scheduled_at < '2026-07-20 10:32:00' AND (appointments.scheduled_at + (services.duration_minutes * interval '1 minute')) > '2026-07-20 09:01:00') LIMIT 1